system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: C:\Users\pdh24\Desktop\Concordia Classes\Rockets\blend\CR-25 medium mesh.blend
// Export date: 2024-08-17 23:51:38.113671

convertToMeters 1;

vertices
(
    ( -3.04 -3.04 -3.04 )
    ( 9.04 -3.04 -3.04 )
    ( 9.04 3.04 -3.04 )
    ( -3.04 3.04 -3.04 )
    ( -3.04 -3.04 3.04 )
    ( 9.04 -3.04 3.04 ) 
    ( 9.04 3.04 3.04 ) 
    ( -3.04 3.04 3.04 ) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (151 76 76) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    
inlet
    {
        type patch;
        faces
        (

            (0 4 7 3)
            
        );
    }

outlet
    {
        type patch;
        faces
        (
           
            (2 6 5 1)
            
        );
    }

sides
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }

);
