system/meshQualityDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: C:\Users\pdh24\Desktop\Concordia Classes\Rockets\blend\CR-25 medium mesh.blend
// Export date: 2024-08-18 14:58:02.437950

maxNonOrtho     35;
maxBoundarySkewness 2.0;
maxInternalSkewness 1.5;
maxConcave      30;
minVol          1e-15;
minTetQuality   1e-15;
minArea         1e-30;
minTwist        0.05;
minDeterminant  0.001;
minFaceWeight   0.05;
minVolRatio     0.05;
minTriangleTwist 0.6;

// Relaxed quality criteria for layer addition phase

relaxed {
    maxNonOrtho 65;
}
