system/snappyHexMeshDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: C:\Users\pdh24\Desktop\Concordia Classes\Rockets\blend\CR-25 medium mesh.blend
// Export date: 2024-08-18 19:03:03.953247

// Details about SnappyHexMesh parameters can be found in annotated caseDicts:
// - For openfoam.org (development version), see
//   https://github.com/OpenFOAM/OpenFOAM-dev/blob/master/etc/caseDicts/annotated/snappyHexMeshDict
// - For openfoam.com (development version), see
//   https://develop.openfoam.com/Development/openfoam/-/blob/master/etc/caseDicts/annotated/snappyHexMeshDict
// See also links in https://openfoamwiki.net/index.php/SnappyHexMesh

castellatedMesh true;
snap            true;
addLayers       false;

mergePatchFaces false;  // Avoid face merging to increase layer coverage

geometry
{
    rocket
    {
        type triSurfaceMesh;
        file "rocket.stl";
        // Min Bounds = [ 9.50825e-07 -7.36521e-02 -1.24298e-01]
        // Max Bounds = [ 3.23994e+00  1.41840e-01  1.24298e-01]
        // Area = 1.14863e+00
    }
}

castellatedMeshControls
{
    maxLocalCells   100000;
    maxGlobalCells  10000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.1;
    nCellsBetweenLevels 4;
    locationInMesh (-1 0 0);
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle 30;
    // useLeakClosure true; // OpenFOAM.com option
    handleSnapProblems true;
    useTopologicalSnapDetection true;

    features
    (
        {
            file "rocket.eMesh";
            level 0;
        }

    );

    refinementSurfaces
    {
        rocket
        {
            level (1 2);
            patchInfo { type wall; }
            
        }

    }

    refinementRegions
    {
        rocket
        {
            mode distance;
            levels ((0.5 2) (1 1));
        }

    }
}

snapControls
{
    nSmoothPatch 2;
    nSmoothInternal 1; // OpenFOAM.com option
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 3;
    nFeatureSnapIter 3;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
    nFaceSplitInterval -1; // OpenFOAM.com option
    releasePoints false;  // multi-region related option
    stringFeatures true;
    avoidDiagonal false;
    strictRegionSnap false;
    concaveAngle 45;
    minAreaRatio 0.3;
}

addLayersControls
{
    // Layer sizing
    relativeSizes true;
    expansionRatio 1.3;
    finalLayerThickness 0.1;
    minThickness 0.001;
    nGrow 0;

    // Mesh dependencies
    featureAngle 85;
    mergePatchFacesAngle 45; // OpenFOAM.com option
    layerTerminationAngle 45; // OpenFOAM.com option
    maxFaceThicknessRatio 0.5;
    disableWallEdges false;

    // Mesh displacement iterations
    nSmoothSurfaceNormals 2;
    nSmoothThickness 10;
    nSmoothNormals 3;
    nSmoothDisplacement 12;
    nMedialAxisIter 1000;

    // Medial axis analysis
    minMedianAxisAngle 90;
    maxThicknessToMedialRatio 0.5;
    slipFeatureAngle 30;
    nRelaxIter 10;

    // OpenFOAM.com displacement motion solver
    // meshShrinker displacementMotionSolver;
    // solver displacementLaplacian;
    // displacementLaplacianCoeffs { diffusivity quadratic inverseDistance ("wall.*"); }

    // Mesh shrinking overall settings
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
    nRelaxedIter 20;
    nOuterIter 1000; // OpenFOAM.com option, 1=single pass layer addition
    additionalReporting true;

    layers
    {

    }
}

meshQualityControls
{
    nSmoothScale    4;
    errorReduction  0.75;
    #include "meshQualityDict"
}

writeFlags      ( scalarLevels layerSets layerFields );

mergeTolerance  1e-06;
